# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
data1 = pd.Series(np.random.randint(1, 4, 100))
data2 = pd.Series(np.random.randint(1, 3, 100))
data3 = pd.Series(np.random.randint(10000, 30000, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
df = pd.concat([data1, data2, data3], axis=1)
df.head()

   0  1      2
0  3  1  25908
1  1  2  22217
2  3  1  21677
3  3  1  12318
4  1  1  17389

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
df.columns = ["bedrs", "bathrs", "price_sqr_meter"]

In [12]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            25908
1      1       2            22217
2      3       1            21677
3      3       1            12318
4      1       1            17389

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
bigcolumns = df = pd.concat([data1, data2, data3], axis=0)

In [15]:
bigcolumns

0         3
1         1
2         3
3         3
4         1
      ...
95    10481
96    22910
97    13234
98    20370
99    22645
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [16]:
bigcolumns.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [17]:
bigcolumns.reset_index(drop=True, inplace=True)

In [21]:
bigcolumns.to_frame()

         0
0        3
1        1
2        3
3        3
4        1
..     ...
295  10481
296  22910
297  13234
298  20370
299  22645

[300 rows x 1 columns]